// #2
import { useState } from 'react'
import reactLogo from './assets/react.svg'
import viteLogo from '/vite.svg'
import './App.css'
import Client from "./Client.jsx";

function App() {

  return (
    <>
        {/* לפני שעשינו את החלק עם הדאטה של הקליינט והיה לנו סתם שדות של קונסט קליינט בתוך סוגריים מסולסלים - מה שהיה מוטמע באותה הקומפוננטה והיא הייתה מציגה את אותו התוכן עבור על קליינט = ז״א לפני שקיבלנו את הפרטים על הקליינט מבחוץ בעזרת הדאטה.
        <Client/>
        <Client/>
        <Client/>
         בעיה אם אני עושה ככה כי זה עדיין תמיד אותו לקוח  */}

        {/* אבל אחרי שאנחנו מוסיפים פרופס בקומפוננטה הפונקציונלית של קליינט ומגדירים אותם לפי הדאטה שתתקבל מבחוץ זה יראה כך:

       <Client data={{ // מרנדר לי את הקומפוננטה הריאקטית קליינט
           // ככה אני בעצם שולחת לקליינט בprops את המידע הזה מבחוץ
           name: "Eva",
           phone: "0543946405",
           totalPurcheses: 15
       }}/>
        {/* ועכשיו אני יכולה להחזיק כמה קליינטים כאלה עם מידע שונה:
        <Client data={{
            name: "Anna",
            phone: "0543951591",
            totalPurcheses: 23
        }}/>
        {/* עכשיו אנחנו כן מקבלים את המידע מבחוץ אבל עכשיו חזרנו לאותה בעיה שהמידע על הקליינטים נמצא בjsx אז צריך לרוקן אותו מכאן ולנהל את זה נכון!
         איך עושים את זה?
          יצרנו עכשיו קובץ קומפוננטה נוסף : ClientsData - #3 file
          והעברנו את הקליינטס לשם כקונסטים.
          <div>
              Here is The Clients List:
          </div>
              <ClientsData/> // מרנדר לי את מה שנמצא בקומפוננטה קליינטס-דאטה ז״א השני לקוחות שברטרן שם
          <div>
          </div>
          אבל מה הבעיה עכשיו?
          עכשיו בקךיינטס דאטה תמיד מוצגים לי אותם שני לקוחות בגלל איך שהגדרתי אותם שם.
          זה לא שעכשיו כל פעם שאני צריכה להוסיף עוד לקוח ושירנדר לי אותו אז שאני אצטרך להוסיף באותה הדרך שדה עם מידע של קליינט 3 ולרנדר אותו גם כן כמו השאר בריטרן של קליינטס דאטה!
          זה למה לא פשוט משתנה קבוע עבור כל קליינט כמו client1 , client2...
          אז מה שנעשה זה ליצור קונסט מערך בקליינטס דאטה ולהעתיק אליו את הקליינטס - דינאמי בגודל.
          יהיה אפשר להציג את זה באמצעות לולאה בריטרן של הקומפוננטה קליינטס-דאטה, הדאטה של כל קליינט בהתאם למיקום הקליינט במערך ואז לא צריך כל פעם להוסיף רינדור לקליינט חדש בריטרן.

            */}

    </>
  )
}

export default App
