// #1
// קובץ של קומפוננטה שהוספנו לבד על ידי לחיצה על + ואז גררתי למקום הנכון.
// כדי שנוכל להציג את הקומפוננטה הזאת בדפדפן אני צריכה לעשות לקובץ הזה אימפורט בקובץ App.jsx ובריטרן של הקומפוננטה שם צריך להוסיף תגית של קליינט כדי שיציג אותו.
import React from 'react';


function Client(props){
    // קומפוננטה ריאקטית!!
    const client = props.data // יקבל עכשיו את המידע מבחוץ!
    // המשמעות של זה שאנחנו נשלח מבחוץ איזשהוא אובייקט דאטה ואז נגיד לו להוסיף את הדאטה הזה על הקליינט.

    // הקומפוננטה קליינט היא בטטית לחלוטין ז״א המידע שלה אף פעם לא משתנה!
    // אני צריכה לרוקן מהמבנה שלי כל מה שהוא לא jsx . לדוגמה המידע ששמנו בהתחלה בריטרן זה פשוט מידע
    // לכן נעשה את זה ככה:
    //const client  = { // קומפוננטה לא ריאקטית!!
        // אבל מה הבעיה? תמיד ירנדר את מה שמופיע כאן - זה לא יתעדכן אם לא נותנים אפשרות לעדכן ולכן נוסיף props בסוגריים של הקומפוננטה
    //    name: "Eva",
    //    phone: "0543946405",
    //    totalPurchases: 15
        // אסור שיהיה לי פה מצב של 2 שדות כאשר אחד מהם מגזר מהשדה האחר!  זה למה לא היינו יכולים לדוגמה לשים פה בוליאן של אם יש יותר מ10 רכישות.
        // למה? כי אם רק אחד מהם יעודכן זה ייצור סתירה!


return (
        <>
            <div style={{
                border: "1px solid blue"
            }}>

                {/*עבור כל רכיב שיהיה לי אני ארצה לעשות דיב בשבילו
                <div>Name: Eva</div>
                <div>Phone: 0543946405</div>
                <div>Total Purchases: 15</div>
                <div>VIP Client</div>
                 אבל חייב לרוקן את כל המידע מה-jsx!

                 אז איך כן עושים את זה נכון:
                  אגב זה לא קשור לדאטה שבחרתי שנקבל מבחוץ - הקוד שכאן זה איך אנחנו מציירים את הדאטה לגבי הלקוח*/}
                <div>Name: {client.name}</div>
                <div>Phone: {client.phone}</div>
                <div>Total Purchases: {client.totalPurchases}</div>
                {
                    client.totalPurchases > 10 && // conditional rendering ביטוי טרנרי -
                    <div>VIP Client</div> // רק אם התנאי מתקיים אז יציג את זה אחרת לא יעשה כלום:
                }
            </div>
        </>//נקרא ריאקט פרגמנט
    )
}

export default Client //הופך את זה להיות פאבליק